research/visualization_methods/outputs/Model__hgf_smoothing/hgf_smoothing.dot
digraph G {
  "GCV" [label="GCV"];
  "Normal" [label="Normal"];
  "i" [label="i"];
  "mean" [label="mean"];
  "variance" [label="variance"];
  "x" [label="x"];
  "x_prev" [label="x_prev"];
  "y" [label="y"];
  "y_variance" [label="y_variance"];
  "z" [label="z"];
  "z_prev" [label="z_prev"];
  "z_variance" [label="z_variance"];
  "κ" [label="κ"];
  "ω" [label="ω"];
  "GCV" -> "x";
  "Normal" -> "x_prev";
  "Normal" -> "y";
  "Normal" -> "z";
  "Normal" -> "z_prev";
  "Normal" -> "κ";
  "Normal" -> "ω";
  "i" -> "x";
  "i" -> "y";
  "mean" -> "x_prev";
  "mean" -> "y";
  "mean" -> "z";
  "mean" -> "z_prev";
  "mean" -> "κ";
  "mean" -> "ω";
  "variance" -> "x_prev";
  "variance" -> "y";
  "variance" -> "z";
  "variance" -> "z_prev";
  "variance" -> "κ";
  "variance" -> "ω";
  "x" -> "y";
  "x_prev" -> "x";
  "y_variance" -> "y";
  "z" -> "x";
  "z_prev" -> "z";
  "z_variance" -> "z";
  "κ" -> "x";
  "ω" -> "x";
}
