research/visualization_methods/outputs/Model__hgf_smoothing/hgf_smoothing.mmd
graph TD
  GCV["GCV"]
  Normal["Normal"]
  i["i"]
  mean["mean"]
  variance["variance"]
  x["x"]
  x_prev["x_prev"]
  y["y"]
  y_variance["y_variance"]
  z["z"]
  z_prev["z_prev"]
  z_variance["z_variance"]
  κ["κ"]
  ω["ω"]
  GCV --> x
  Normal --> x_prev
  Normal --> y
  Normal --> z
  Normal --> z_prev
  Normal --> κ
  Normal --> ω
  i --> x
  i --> y
  mean --> x_prev
  mean --> y
  mean --> z
  mean --> z_prev
  mean --> κ
  mean --> ω
  variance --> x_prev
  variance --> y
  variance --> z
  variance --> z_prev
  variance --> κ
  variance --> ω
  x --> y
  x_prev --> x
  y_variance --> y
  z --> x
  z_prev --> z
  z_variance --> z
  κ --> x
  ω --> x
